In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("./data/newreindex.csv")

In [3]:
df

         Unnamed: 0  user_id  content_id  answered_correctly
0            203420        1           1                 0.5
1            204974        1        1556                 0.0
2            204975        1        1557                 0.0
3            204976        1        1558                 0.0
4            204977        1        1559                 0.0
...             ...      ...         ...                 ...
1137362    57082428      356        2118                 0.0
1137363    57081698      356        1238                 1.0
1137364    57080758      356         267                 1.0
1137365    57080757      356         266                 0.0
1137366    57081699      356        1239                 0.0

[1137367 rows x 4 columns]

In [4]:
df2 = pd.read_csv("../corpus/data/problemcorpus.csv")

In [5]:
df2

      CorId                                             corpus
0         0  The assets of Marble Faun Publishing Company s...
1         1  lndie film director Luke Steele will be in Lon...
2         2  Laboratory employees are expected to wear a na...
3         3  The latest training guide contains tips on tea...
4         4  Once you have your resume with references and ...
...     ...                                                ...
3620   3620  All employees should back up crucial data befo...
3621   3621  A label on each box should indicate the produc...
3622   3622  Ms. Jha assured the client that she would deli...
3623   3623  During negotiations, management appeared agree...
3624   3624  Employees across several departments have been...

[3625 rows x 2 columns]

In [6]:
df2['CorId']+=1

In [7]:
df2

      CorId                                             corpus
0         1  The assets of Marble Faun Publishing Company s...
1         2  lndie film director Luke Steele will be in Lon...
2         3  Laboratory employees are expected to wear a na...
3         4  The latest training guide contains tips on tea...
4         5  Once you have your resume with references and ...
...     ...                                                ...
3620   3621  All employees should back up crucial data befo...
3621   3622  A label on each box should indicate the produc...
3622   3623  Ms. Jha assured the client that she would deli...
3623   3624  During negotiations, management appeared agree...
3624   3625  Employees across several departments have been...

[3625 rows x 2 columns]

In [8]:
df3=df.merge(df2, left_on='content_id', right_on='CorId', how='outer')

In [9]:
df3

,Unnamed: 0,user_id,content_id,answered_correctly,CorId,corpus
0,203420.0,1.0,1.0,0.500000,1,The assets of Marble Faun Publishing Company s...
1,321577.0,2.0,1.0,1.000000,1,The assets of Marble Faun Publishing Company s...
2,1073189.0,3.0,1.0,1.000000,1,The assets of Marble Faun Publishing Company s...
3,1086443.0,4.0,1.0,0.750000,1,The assets of Marble Faun Publishing Company s...
4,1764779.0,5.0,1.0,0.666667,1,The assets of Marble Faun Publishing Company s...
...,...,...,...,...,...,...
1137413,NaN,NaN,NaN,NaN,3621,All employees should back up crucial data befo...
1137414,NaN,NaN,NaN,NaN,3622,A label on each box should indicate the produc...
1137415,NaN,NaN,NaN,NaN,3623,Ms. Jha assured the client that she would deli...
1137416,NaN,NaN,NaN,NaN,3624,"During negotiations, management appeared agree..."
1137417,NaN,NaN,NaN,NaN,3625,Employees across several departments have been...

In [10]:
df3=df3.dropna()
df3

,Unnamed: 0,user_id,content_id,answered_correctly,CorId,corpus
0,203420.0,1.0,1.0,0.500000,1,The assets of Marble Faun Publishing Company s...
1,321577.0,2.0,1.0,1.000000,1,The assets of Marble Faun Publishing Company s...
2,1073189.0,3.0,1.0,1.000000,1,The assets of Marble Faun Publishing Company s...
3,1086443.0,4.0,1.0,0.750000,1,The assets of Marble Faun Publishing Company s...
4,1764779.0,5.0,1.0,0.666667,1,The assets of Marble Faun Publishing Company s...
...,...,...,...,...,...,...
1137362,48248104.0,290.0,3106.0,-0.333333,3106,The production of tim ore in the United States...
1137363,48444037.0,294.0,3106.0,0.000000,3106,The production of tim ore in the United States...
1137364,49987576.0,305.0,3106.0,0.000000,3106,The production of tim ore in the United States...
1137365,51991540.0,320.0,3106.0,1.000000,3106,The production of tim ore in the United States...
1137366,52369729.0,323.0,3106.0,1.000000,3106,The production of tim ore in the United States...

In [14]:
df3=df3.drop(['CorId'],axis=1)

KeyError: "['CorId'] not found in axis"

In [15]:
df3=df3.drop(['Unnamed: 0'],axis=1)
df3

,user_id,content_id,answered_correctly,corpus
0,1.0,1.0,0.500000,The assets of Marble Faun Publishing Company s...
1,2.0,1.0,1.000000,The assets of Marble Faun Publishing Company s...
2,3.0,1.0,1.000000,The assets of Marble Faun Publishing Company s...
3,4.0,1.0,0.750000,The assets of Marble Faun Publishing Company s...
4,5.0,1.0,0.666667,The assets of Marble Faun Publishing Company s...
...,...,...,...,...
1137362,290.0,3106.0,-0.333333,The production of tim ore in the United States...
1137363,294.0,3106.0,0.000000,The production of tim ore in the United States...
1137364,305.0,3106.0,0.000000,The production of tim ore in the United States...
1137365,320.0,3106.0,1.000000,The production of tim ore in the United States...
1137366,323.0,3106.0,1.000000,The production of tim ore in the United States...